# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [1]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('data.sqlite')
c = conn.cursor()


#Your code here; import the necessary packages

In [3]:
#Your code here; create the connection and cursor

## Write an Equivalent Query using a Subquery

```SQL
select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';
```

In [18]:
#Your code here; use a subquery. No join will be necessary.
c.execute('''select customerNumber, contactLastName, contactFirstName from customers where customerNumber in (select customerNumber from orders where orderDate = '2003-01-31')''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head()

  customerNumber contactLastName contactFirstName
0            141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [28]:
c.execute('''select productName, COUNT(orderNumber) from products join orderdetails using(productCode) group by 1 order by 2 desc;''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head(20)

                                  productName  COUNT(orderNumber)
0                 1992 Ferrari 360 Spider red                  53
1         18th Century Vintage Horse Carriage                  28
2                      1900s Vintage Bi-Plane                  28
3                     1900s Vintage Tri-Plane                  28
4                 1913 Ford Model T Speedster                  28
5                    1917 Maxwell Touring Car                  28
6                       1926 Ford Fire Engine                  28
7            1928 British Royal Navy Airplane                  28
8                    1928 Ford Phaeton Deluxe                  28
9                      1928 Mercedes-Benz SSK                  28
10               1930 Buick Marquette Phaeton                  28
11                  1932 Model A Ford J-Coupe                  28
12                         1934 Ford V8 Coupe                  28
13                      1936 Chrysler Airflow                  28
14        1936 Harley Davidson El Knucklehead                  28
15   1936 Mercedes-Benz 500K Special Roadster                  28
16                  1937 Horch 930V Limousine                  28
17                       1937 Lincoln Berline                  28
18  1938 Cadillac V-16 Presidential Limousine                  28
19                    1939 Cadillac Limousine                  28

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

In [ ]:
#Your code here

## Select the Employee Number, Office Code, City (of the office), and Name (First and Last) of those Employees who Sold Products that Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [ ]:
#Your code here

## Select the Employee Number, Name (First and Last) and Number of Customers of Employees Who's Customers Have an Average Credit Limit of Over 15K

In [ ]:
#Your code here

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!